[
    {
        "id": 1,
        "title": "Hukum Kirchhoff - Dasar Teori dan Aplikasi",
        "description": "Kursus ini membahas konsep Hukum Kirchhoff tentang tegangan dan arus dalam rangkaian listrik.",
        "instructor": "Edo Anugrah",
        "category": "Fisika - Kelistrikan",
        "level": "SMA Kelas 12",
        "created_at": "2025-10-03T12:58:08.388646",
        "modules": [
            {
                "id": 3,
                "title": "Praktikum Hukum I Kirchhoff",
                "content": "Selamat! Anda telah menyelesaikan tahap pemahaman konsep.\n\nAnda sudah menonton video dan mempelajari teori dasar Hukum Kirchhoff 1 (Hukum Arus). Sekarang saatnya untuk mengaplikasikan pemahaman tersebut ke dalam soal-soal terstruktur. Seperti kata pepatah, \"Anda tidak benar-benar memahami sesuatu sampai Anda bisa mengajarkannya kembali,\" dan langkah pertama untuk itu adalah bisa menerapkannya untuk memecahkan masalah.\n\nPada halaman ini, Anda akan menemukan Lembar Kerja Peserta Didik (LKPD) yang telah dirancang khusus untuk melatih keterampilan Anda.\n\n📝 Lembar Kerja Peserta Didik (LKPD) Hukum Kirchhoff 1\nPetunjuk Pengerjaan:\n1.\tKlik link LKPD di atas.\n2.\tPrin LKPD yang telah Anda unduh.\n3.\tTunjukkan langkah pengerjaan Anda dengan jelas untuk setiap soal. Langkah yang rapi dan logis akan memudahkan Anda dalam memeriksa ulang.",
                "media_ids": [
                    6,
                    7
                ]
            },
            {
                "id": 1,
                "title": "Pengenalan Pembelajaran Materi Listrik Dinamis: Hukum Kirchhoff",
                "content": "Selamat datang, para ilmuwan muda kelas XII!\n\nApakah kalian pernah membayangkan bagaimana seorang insinyur elektronik merancang sebuah motherboard komputer yang sangat rumit, atau bagaimana teknisi dapat menemukan kerusakan pada rangkaian listrik yang kompleks? Rahasia di baliknya seringkali terletak pada penguasaan mereka terhadap sebuah hukum fundamental dalam fisika: Hukum Kirchhoff.\n\nDalam topik Listrik Dinamis ini, kita akan meninggalkan sejenak rangkaian seri dan paralel sederhana, dan melangkah ke dunia yang lebih menantang sekaligus menarik: Rangkaian Majemuk. Di sinilah Hukum Ohm saja tidak lagi cukup, dan di sinilah Hukum Kirchhoff menjadi \"pahlawan\" yang akan membimbing kita untuk menganalisis aliran arus dan tegangan di setiap sudut rangkaian.\n\nMengapa Materi Ini Penting untuk Kalian Pahami?\n•\tLandasan Ilmu Teknik: Hukum Kirchhoff adalah fondasi utama bagi kalian yang ingin melanjutkan studi di bidang teknik elektro, robotika, komputer, dan teknologi lainnya.\n•\tPemecahan Masalah yang Sistematis: Materi ini melatih kemampuan logika dan pemecahan masalah (problem-solving) kalian dengan pendekatan yang sangat terstruktur.\n•\tMenerjemahkan Teori ke Aplikasi Nyata: Dari menghitung daya pada sirkuit hingga memahami sistem kelistrikan pada kendaraan listrik, semuanya berawal dari pemahaman ini.\n\nAyo, Mulai Perjalanan Belajar Kalian!\nUntuk memudahkan perjalanan belajar kalian, kami telah menyusun materi ini ke dalam dua bagian utama yang dapat kalian akses di bawah ini:",
                "video_url": "https://youtu.be/ALeDH_6qn5M?si=70CS97C7k-W9TzrC",
                "media_ids": [
                    1,
                    2,
                    3,
                    4
                ]
            },
            {
                "id": 4,
                "title": "Hukum II Kirchhoff",
                "content": "Selamat! Anda telah menguasai hukum yang mengatur perilaku arus listrik pada suatu titik.\n\nSekarang, kita akan melangkah ke hukum kedua yang menyempurnakan alat analisis kita. Jika Hukum Kirchhoff 1 adalah tentang kekekalan muatan listrik pada sebuah titik, maka Hukum Kirchhoff 2 adalah tentang kekekalan energi dalam sebuah loop tertutup.\n\n📹 Video Pembelajaran: Memahami Hukum Kirchhoff 2\nKonsep dalam Hukum Kirchhoff 2 lebih abstrak daripada Hukum 1. Oleh karena itu, menonton video penjelasan ini dengan seksama adalah kunci pemahaman Anda.\n\nArahan Menonton:\n•\tFokus penuh! Konsep aturan tanda adalah yang paling penting dalam video ini.\n•\tCatat aturan tanda untuk GGL (ε) dan Tegangan Resistor (IR) dengan jelas.\n•\tPerhatikan bagaimana arah loop dan arah arus mempengaruhi perhitungan.\n•\tJeda video dan coba pahami logika di balik setiap langkah yang dilakukan.",
                "type": "video",
                "video_url": "https://youtu.be/_hGdqDvstiQ?si=JjWP6v0fgRf1aeFf",
                "media_ids": [
                    8,
                    9
                ]
            },
            {
                "id": 2,
                "title": "Hukum I Kirchhoff",
                "content": "Selamat datang di bagian inti pembelajaran kita!\n\nSetelah di pertemuan sebelumnya kita memahami kerangka besar analisis rangkaian kompleks, kini saatnya kita menggali hukum pertama yang menjadi fondasi dari analisis tersebut: Hukum Kirchhoff 1, yang sering juga disebut Hukum Arus Kirchhoff (Kirchhoff's Current Law - KCL).\n\nHukum ini mungkin terdengar kompleks, tetapi sebenarnya konsepnya sangat intuitif dan mirip dengan sesuatu yang kita alami sehari-hari!\n\n📹 Video Pembelajaran: Inti dari Hukum Kirchhoff 1\nUntuk membantu pemahaman kamu, tontonlah video penjelasan berikut dengan seksama. Video ini akan memvisualisasikan segala sesuatu yang telah disebutkan di atas dengan animasi yang jelas.\n\nArahan Menonton:\n•\tSiapkan alat tulis dan catatanmu. Jangan hanya menonton, tapi catat poin-poin penting yang dijelaskan.\n•\tFokus pada penjelasan tentang apa itu \"simpul\" dan bagaimana arah arus ditentukan.\n•\tPahami logika mengapa \"jumlah arus yang masuk sama dengan jumlah arus yang keluar\".\n•\tJangan ragu untuk menjeda video untuk memahami langkah-langkahnya.",
                "type": "video",
                "video_url": "https://youtu.be/C5_-_C52UtU?si=-MwgcZN3KNI2xhP2",
                "media_ids": [
                    5
                ]
            },
            {
                "id": 5,
                "title": "Praktikum Hukum II Kirchhoff",
                "content": "Sekarang, waktunya tantangan yang sesungguhnya!\n\nAnda telah mempelajari kedua hukum Kirchhoff. Hukum pertama mengatur \"lalu lintas arus\" di persimpangan (simpul), sedangkan hukum kedua mengatur \"keseimbangan energi\" dalam sebuah perjalanan keliling (loop). Untuk menganalisis rangkaian majemuk yang sebenarnya, Anda harus mahir dalam menerapkan kedua hukum ini secara bersamaan.\n\nLKPD pada halaman ini dirancang untuk melatih Anda menerapkan Hukum Kirchhoff 2 secara spesifik, yang merupakan langkah kritis dalam penyelesaian rangkaian majemuk.\n\n📝 Lembar Kerja Peserta Didik (LKPD) Hukum Kirchhoff 2\nPetunjuk Pengerjaan:\n1.\tDownload LKPD di atas.\n2.\tPrinlah LKPD yang telah Anda unduh, lalu baca soal dengan cermat. Identifikasi semua komponen, arah arus (jika sudah ditentukan), dan loop yang memungkinkan.\n3.\tKerjakan dengan langkah yang JELAS dan TERSTRUKTUR. Tunjukkan proses berpikir Anda.",
                "media_ids": [
                    10,
                    11
                ]
            },
            {
                "id": 6,
                "title": "Latihan Soal",
                "content": "Tibalah saatnya menguji pemahaman menyeluruh Anda!\n\nAnda telah mempelajari teori, menonton video, dan berlatih melalui LKPD untuk masing-masing hukum. Sekarang, di halaman akhir modul ini, Anda akan dihadapkan pada Latihan Soal Komprehensif yang menggabungkan penerapan Hukum Kirchhoff 1 dan Hukum Kirchhoff 2. Latihan ini dirancang untuk mengukur sejauh mana Anda mampu menerapkan seluruh konsep yang telah dipelajari dalam berbagai bentuk soal.\n\n📝 Latihan Soal Hukum Kirchhoff 1 & 2\nPetunjuk Pengerjaan:\n1.\tMasuk ke link berkas soal di bawah ini.\n2.\tKerjakan secara mandiri terlebih dahulu. Ini adalah evaluasi untuk diri Anda sendiri.\n3.\tUntuk soal Pilihan Ganda: Pilihlah jawaban yang paling tepat dengan memberikan tanda (X) pada pilihan A, B, C, D, atau E.\n4.\tUntuk soal Essay: Tunjukkan semua langkah pengerjaan Anda secara jelas dan sistematis di kertas/buku catatan. Jawaban akhir tanpa langkah kerja tidak akan mendapat nilai penuh.\n5.\tAlokasi Waktu: 45 menit.\nSelamat mengerjakan! Semoga sukses!\n\nSelamat!\nDengan menyelesaikan latihan ini, berarti Anda telah menyelesaikan seluruh rangkaian modul Listrik Dinamis: Hukum Kirchhoff. Terima kasih atas ketekunan dan usaha kerasnya!",
                "type": "latihan",
                "files": [
                    {
                        "title": "Lembar Latihan Soal",
                        "url": "https://online.fliphtml5.com/riaps/axtk/"
                    }
                ],
                "media_ids": [
                    12
                ]
            },
            {
                "id": 7,
                "title": "Pembahasan Soal dan Evaluasi",
                "content": "Selamat! Anda telah menyelesaikan perjalanan belajar yang menantang ini.\n\nMengerjakan soal latihan adalah langkah yang sangat baik. Namun, proses belajar yang sesungguhnya terjadi ketika Anda memahami letak kesalahan, merefleksikan pemahaman, dan mengonsolidasi pengetahuan. Halaman ini adalah ruang bagi kita untuk melakukan hal tersebut bersama-sama.\n\nDi bawah ini, Anda akan menemukan pembahasan lengkap dan mendetail untuk beberapa soal kunci dari latihan, baik Pilihan Ganda maupun Essay.\n\nJika nilai Anda sudah memuaskan, fantastic! Pertahankan. Jika masih ada yang kurang, jangan khawatir. Kembalilah ke bahan ajar dan video pada bagian yang masih lemah. Belajar adalah sebuah proses.\n\nAnda telah menyelesaikan modul Listrik Dinamis: Hukum Kirchhoff dengan sangat baik. Komitmen Anda untuk belajar hingga tahap ini sangat dihargai. Teruslah berlatih dan jangan ragu untuk mengulang materi jika diperlukan.\n\n\"The beautiful thing about learning is that no one can take it away from you.\" - B.B. King",
                "type": "pembahasan",
                "files": [
                    {
                        "title": "Lembar Pembahasan Soal",
                        "url": "https://online.fliphtml5.com/riaps/brjl/"
                    }
                ],
                "media_ids": [
                    13
                ]
            }
        ]
    }
]